app/controllers/invoices_controller.rb

SELECT `invoices`.* FROM `invoices`
---
  def index
    @invoices = Invoice.all

INSERT INTO `invoices` (`created_at`, `updated_at`) VALUES (?, ?)  [["created_at", Fri, 11 Apr 2014 03:48:23 UTC +00:00], ["updated_at", Fri, 11 Apr 2014 03:48:23 UTC +00:00]]
---
  def create
    @invoice = Invoice.new(invoice_params)

    respond_to do |format|
      if @invoice.save

DELETE FROM `invoices` WHERE `invoices`.`id` = ?  [["id", 1]]
---
  def destroy
    @invoice.destroy

SELECT `invoices`.* FROM `invoices` WHERE `invoices`.`id` = ? LIMIT 1  [["id", "1"]]
---
    def set_invoice
      @invoice = Invoice.find(params[:id])