app/controllers/layouts_controller.rb

SELECT `layouts`.* FROM `layouts`
---
  def index
    @layouts = Layout.all

SELECT `layouts`.* FROM `layouts`
---
  def show
    @layouts = Layout.all

INSERT INTO `layouts` (`created_at`, `description`, `length`, `ou`, `start`, `type`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", Fri, 11 Apr 2014 17:51:07 UTC +00:00], ["description", "as"], ["length", 2], ["ou", "s"], ["start", 1], ["type", ""], ["updated_at", Fri, 11 Apr 2014 17:51:07 UTC +00:00]]
---
 def create
   unless params[:upload].nil?
       post = Layout.save(params[:upload])

DELETE FROM `layouts` WHERE `layouts`.`id` = ?  [["id", 8]]
---
 def destroy

   Layout.delete_all

DELETE FROM `layouts`
---
  def delete_file
       Layout.delete_all