app/controllers/suppliers_controller.rb

  def index
    @suppliers = Supplier.all
---
SELECT `suppliers`.* FROM `suppliers`