app/controllers/uploads_controller.rb

SELECT `uploads`.* FROM `uploads`
---
  def index
      @uploads = Upload.all

INSERT INTO `uploads` (`created_at`, `updated_at`) VALUES (?, ?)  [["created_at", Thu, 10 Apr 2014 14:36:50 UTC +00:00], ["updated_at", Thu, 10 Apr 2014 14:36:50 UTC +00:00]]
---
    def create



       @media =params[:upload]

           unless params[:upload].nil?
            post = Upload.save(params[:upload])